# Pivot Table in Pandas

In [ ]:
import pandas as pd

## On Titanic Disaster Dataset

In [ ]:
df = pd.read_csv('Titanic_train.csv')

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [ ]:
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

## Pivot Table

Let’s say that we want to find out the mean age of both male and female based on the Pclass they were travelling on. 

So we make create a pivot table.

In [ ]:
df.pivot_table(index="Pclass", columns = "Sex" , values="Age", aggfunc='mean')

Sex        female       male
Pclass
1       34.611765  41.281386
2       28.722973  30.740707
3       21.750000  26.507589

#+++++++++++++++++++++++++++++++++++++++++++++++

## On German Credit Dataset

In [ ]:
gc=pd.read_csv('german_credit.csv')

In [ ]:
gc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Unnamed: 0        1000 non-null   int64
 1   Age               1000 non-null   int64
 2   Sex               1000 non-null   object
 3   Job               1000 non-null   int64
 4   Housing           1000 non-null   object
 5   Saving accounts   817 non-null    object
 6   Checking account  606 non-null    object
 7   Credit amount     1000 non-null   int64
 8   Duration          1000 non-null   int64
 9   Purpose           1000 non-null   object
dtypes: int64(5), object(5)
memory usage: 78.2+ KB

In [ ]:
gc.head()

   Unnamed: 0  Age     Sex  ...  Credit amount Duration              Purpose
0           0   67    male  ...           1169        6             radio/TV
1           1   22  female  ...           5951       48             radio/TV
2           2   49    male  ...           2096       12            education
3           3   45    male  ...           7882       42  furniture/equipment
4           4   53    male  ...           4870       24                  car

[5 rows x 10 columns]

## Pivot Table

Let’s say that we want to find out about the mean of Credit Amount(Loan) taken for different purposes based on Sex, so we will calculate it using pivot_table.

In [ ]:
gc.pivot_table(index="Purpose", columns = ['Sex'] , values="Age", aggfunc='mean')

Sex                     female       male
Purpose
business             31.315789  36.500000
car                  33.712766  38.465021
domestic appliances  24.833333  43.666667
education            37.000000  39.171429
furniture/equipment  29.135135  34.757009
radio/TV             33.752941  35.112821
repairs              38.600000  38.529412
vacation/others      50.000000  36.555556